package ru.otus.main_patterns.hw12;

import java.util.Arrays;
import java.util.List;
import org.slf4j.Logger;
import org.slf4j.LoggerFactory;
import ru.otus.main_patterns.hw12.command.MacroCommand;
import ru.otus.main_patterns.hw12.command.UpdateObjectCellCommand;

/*
  Домашнее задание
  Реализация проверки коллизий игровых объектов

  Цель:
  Научится применять цепочку обязанности

  Описание/Пошаговая инструкция выполнения домашнего задания:
  Предположим, что у нас есть функция/процедура/метод, который умеет для двух игровых объектов
  определять коллизию - столкнулись эти два объекта или нет.
  Эту функцию/процедуру/метод реализовывать не нужно, так это достаточно большая задача.
  Используя эту функцию, реализуем эффективный перебор всех игровых объектов, для определения всех возможных коллизий
  в игре в каждый момент времени.
  Для этого разобьем игровое поле на окрестности, предполагая, что объекты, находящиеся в разных окрестностях
  не могут столкнуться друг с другом. Столкнуться друг с другом могут только объекты из одной окрестности.

  Необходимо:
  1. Реализовать команду, которая
    - определяет окрестность, в которой присутствует игровой объект
    - если объект попал в новую окрестность, то удаляет его из списка объектов старой окрестности и добавляет список
      объектов новой окрестности.
    - для каждого объекта новой окрестности и текущего движущегося объекта создает команду проверки коллизии этих двух объектов.
      Все эти команды помещает в макрокоманду и эту макрокоманду записывает на место аналогичной макрокоманды для предыдущей окрестности.
  2. При подходе с окрестностями может оказаться, что объекты, находящиеся рядом, могут попасть в разные окрестности,
      что не позволит определить коллизию между ними.
      Для решения этой проблемы будем использовать две системы окрестностей - одни окрестности смещены относительно центра других окрестностей.
      Для этого можно использовать несколько команд из п. 1
  3. С помощью команды из 1. организовать проверку коллизий игровых объектов с помощью двух систем окрестностей.

  Критерии оценки:
  1. Задача сдана на проверку. 1 балл
  2. Задача оформлена в виде MR/PR. 1 балл
  3. CI - 1 балл
  4. Реализована команда из п.1
     1 балл, если реализация правильно формирует список игровых объектов для каждой окрестности
     2 балла, если написана полная реализация
  5. Реализованы тесты к команде из п.1
     1 балл, если написан хотя бы один тест
     2 балла, если преподаватель не может указать кейс, который не покрыт тестами.
  6. Реализован механизм с произвольным количеством систем окрестностей из п.3 2 балла
  7. Написаны тесты к п.3 1 балл

  Максимальная оценка за задание 10 баллов
  Задание принимается, если было оценено не менее, чем в 7 баллов

  Решение:
  Полный pipeline выполнения:
      Game Tick
       ↓
    UpdateObjectCellCommand (для каждого объекта)
       ↓
    объект перемещается между клетками
       ↓
    создаются CollisionCommand (для пар объектов)
       ↓
    MacroCommand.execute()
       ↓
    CollisionCommand.execute()
       ↓
    handler.handle(a, b) -> Chain of Responsibility

*/
public class HW12 {
  private static final Logger logger = LoggerFactory.getLogger(HW12.class);

  public static void main(String[] args) {
    logger.info(
        "Java version: {}, Java vendor: {}\nДомашнее задание#12: Реализация проверки коллизий игровых объектов",
        System.getProperty("java.version"),
        System.getProperty("java.vendor"));
    int cellSize = 50;

    // 2 сетки (смещение!)
    Grid grid1 = new Grid(cellSize, 0, 0);
    Grid grid2 = new Grid(cellSize, cellSize / 2, cellSize / 2);

    List<Grid> grids = Arrays.asList(grid1, grid2);

    MacroCommand macro = new MacroCommand();

    List<GameObject> objects =
        Arrays.asList(
            new GameObject(1, 10, 10, 10),
            new GameObject(2, 20, 20, 10),
            new GameObject(3, 55, 55, 10),
            new GameObject(4, 60, 60, 10),
            new GameObject(5, 100, 100, 10),
            new GameObject(6, 110, 105, 10),
            new GameObject(7, 200, 200, 10),
            new GameObject(8, 205, 205, 10),
            new GameObject(9, 300, 300, 10),
            new GameObject(10, 305, 300, 10));

    // симуляция одного тика
    for (GameObject obj : objects) {
      new UpdateObjectCellCommand(obj, grids, macro).execute();
    }

    // выполнение всех коллизий
    macro.execute();
  }
}
