package ru.otus.main_patterns.hwo08;

import org.slf4j.Logger;
import org.slf4j.LoggerFactory;

/*
   Домашнее задание
   Написать Endpoint для приема входящих сообщений

   Цель:
   Написать Endpoint для приема входящих сообщений Игровым сервером.

   Термины:
   - Игровой сервер - это приложение, на котором вычисляется состояние космических боев, то есть выполняются все те команды,
     которые рассматривались на предыдущих занятиях.
   - Агент - это специальное приложение, на котором игрок запускает свой алгоритм управления своей командой кораблей.
   - Для полноценной реализации игры необходимо обеспечить двусторонний обмен данными между Игровым сервером и Агентами.
     Частью такого обмена будет Endpoint для приема входящих сообщений игровым сервером.
   - В результате выполнения ДЗ будет получен код, основанный на паттернах системы обмена сообщениями для приема входящих
     сообщений от Агентов.

   Цель: применить навыки построения архитектуры, основанной на системе обмена сообщениями.
   Описание/Пошаговая инструкция выполнения домашнего задания:
   Задача Endpoint принять входящее сообщение от Агента, десериализовать его и передать его на обработку внутрь игрового сервера.
   Прием входящих сообщений и их десериализацию скорее всего возьмут на себя те библиотеки, которыми Вы будете пользоваться.
   А вот определить какому из космических боев это сообщение было адресовано (маршрутизация) и его уведомление о входящем сообщении
   (передача сообщения в обработку) - это то, что придется делать в рамках этого ДЗ.

   Организовать Endpoint можно реализовать разными способами. Здесь выбирайте тот, который считаете полезным для своих
   прикладных задач на работе, а не для данной игры. Ну или тот, с которым сами бы хотели разобраться.
   Ниже приведены разные варианты, что можно было бы сделать:
   - Endpoint поверх Tcp/IP или UDP протокола.
   - Controller в web-фреймворке.
   - Endpoint на основе веб-сокетов.
   - Rest
   - Подписка на получение сообщений из какого-нибудь Message Broker'а.

   Выбор варианта не сильно отразится на остальной архитектуре, то есть концептуально будет одно и тоже,
   а вот у каждого варианта могут быть свои ньюансы реализации, поэтому степень полезности того или иного способа реализации
   прямо зависит от того, в какую сторону лично Вы хотите развиваться.

   Шаги выполнения ДЗ:
   1. Определить формат сообщений, которые отправляет Агент игровому серверу.
       Указание: правила во всех играх могут сильно отличаться друг от друга, поэтому нужно подумать о таком формате,
       который бы не зависел от текущей реализации конкретных команд, то есть чтобы endpoint не приходилось модифицировать каждый раз,
       когда мы разработаем новое правило игры.
       Как идею для решения поставленной задачи можно рассмотреть следующий набор данных, который стоит передавать в сообщении:
       - id игры - для идентификации игры, в рамках которой это сообщение обработано.
         С помощью этого id можно будет определить получателя сообщения при маршрутизации сообщения внутри игрового сервера.
       - id игрового объекта, которому адресовано сообщение.
         С помощью этого id можно будет определить игровой объект внутри игры, для которого адресовано это сообщение.
       - id операции - по этому id в IoC можно будет определить команду, которая будет обрабатывать данное сообщение.
       - args - вложенный json объект с параметрами операции.
         Содержимое этого объекта полностью зависит от команды, которая будет применяться к игровому объекту.

   2. Определить endpoint, который принимает входящее сообщение и конвертирует в команду InterpretCommand.
     - endpoint должен определить игру, которой адресовано сообщение, создать команду InterpretCommand
       и поместить эту команду в очередь команд этой игры.
     - Команда InterpretCommand получает всю информацию об операции, которую необходимо выполнить, параметрах и объекте,
       над которым эта операция будет выполняться.

   3. Задача команды InterpretCommand на основе IoC контейнера создать команду для нужного объекта,
      которая соответствует приказу, содержащемуся в сообщении и постановки этой команды в очередь команд игры.

      Например, если в сообщении указано, что объект с id 548 должен начать двигаться, то результат InterpretCommand
      можно описать следующим псевдокодом:

       // "548" получено из входящего сообщения
       var obj = IoC.Resolve<UObject>("Игровые объекты", "548");

       // значение 2 получено из args переданного в сообщении
       IoC.Resolve("Установить начальное значение скорости", obj, 2);

       // Решение, что нужно выполнить движение по прямой получено из сообщения.
       // Обратите внимание само значение "Движение по прямой" нельзя читать на прямую из сообщения,
       // чтобы избежать инъекции, когда пользователь попытается выполнить действие, которое ему выполнять не позволено
       var cmd = IoC.Resolve<Command>("Движение по прямой", obj);

       // Выполняем команду, которая поместит команду cmd в очередь команд игры.
       IoC.Resolve<Command>("Очередь команд", cmd).Execute();

       Дополнительно:
       Можно реализовать двусторонний обмен данными между Игровым сервером и Агентом.
       Так как для принятия решения о той или иной операции на Агенте необходимо знать текущее состояние космической битвы.
       Для этого можно использовать websocket или tcp/ip или любой другой способ.
       С точки зрения игры это выглядит так:
        - Есть команда, при выполнении которой она сериализует состояние игровых объектов и инициирует процесс отправки этих данных на Агент.
        - Далее рассылка сохраненного состояния производится через реализованный двусторонний обмен данными.

    Критерии оценки:
      1. Задача сдана на проверку - 1 балл.
      2. Код компилируется без ошибок, тесты выполняются успешно. - 1 балл
      3. Настроен CI, по которому можно определить успешность п. 2 - 2 балла
      4. Описан формат сообщения
          1 балл
          2 балла - формат сообщения универсален и удовлетворяет SOLID
            (принимается, если преподаватель может придумать контрпример, который приводит к изменению формата)
      5. Реализован endpoint, который вычисляет игру и ставит команду в очередь игры
          1 балл
          2 балла - если реализация endpoint эффективна, то есть не использует лишние блокировки и примитивы синхронизации,
            не имеет race conditions.
      6. Реализована InterpretCommand
          1 балл
          2 балла - если удовлетворяет SOLID
            (принимается, если преподаватель может придумать контрпример, который приводит к изменению кода команды)

     Максимальная оценка за задание 10 баллов.
     Задание принимается, если было оценено не менее, чем в 7 баллов.

     Пример HTTP POST запроса на создание команды ROTATE:
     HTTP POST http://localhost:8080/game/order

      {
         "id" : "fd2f09e6-2b88-459e-82d8-71382a0f81a8",
         "gameId": "game-1",
         "playerId": "player-1",
         "operationId": "ROTATE",
         "operationArgs": {
            "radius": 10,
            "angularVelocity": 4
         }
       }

       Примеры запросов здесь restclient.rc
*/
public class HW08 {
  private static final Logger logger = LoggerFactory.getLogger(HW08.class);

  public static void main(String[] args) throws Exception {
    logger.info(
        "Java version: {}, Java vendor: {}\nДомашнее задание#08: Системы обмена сообщениями",
        System.getProperty("java.version"),
        System.getProperty("java.vendor"));

    GameServer gameServer = new GameServer(8080);
    gameServer.start();
    logger.debug("Server started on http://localhost:8080/users");
    gameServer.join();
  }
}
