package ru.otus.main_patterns.hw10;

import org.slf4j.Logger;
import org.slf4j.LoggerFactory;

/*
    Домашнее задание:
    Создать микросервис Авторизация пользователя

    Цель:
    В одном из предыдущих ДЗ необходимо было реализовать Endpoint на Игровом сервере для приема входящих сообщений от Агента.

    Термины:
    Игровой сервер - это приложение, на котором вычисляется состояние космических боев, то есть выполняются все те команды,
    которые рассматривались на предыдущих занятиях.
    Агент - это специальное приложение, на котором игрок запускает свой алгоритм управления своей командой космических кораблей.
    При реализации этого Endpoint возникает задача авторизации пользователя на отправку сообщений для управления командой
    танков в конкретной игре, чтобы не допустить вмешательства в процесс игры сторонними пользователями.
    В результате выполнения этого ДЗ будет разработан микросервис, который выдает jwt токен из участников танкового сражения,
    для того, чтобы игровой сервер мог принять решение о возможности выполнения входящего сообщения от имени пользователя.

    Цель: применить навыки разработки микросервиса.
    Описание/Пошаговая инструкция выполнения домашнего задания:
    Предполагается реализация микросервиса авторизации с помощью jwt токена.

    Алгоритм взаимодействия сервиса авторизации и Игрового сервера следующий:
    1. Один из пользователей организует космический бой и определяет список участников (их может быть больше 2-х).
        На сервер авторизации уходит запрос о том, что организуется космический бой и присылается список его участников.
        Сервер в ответ возвращает id космического боя.
    2. Аутентифицированный пользователь посылает запрос на выдачу jwt токена, который авторизует право этого пользователя на участие в игре.
        Для этого он должен указать в запросе id игры.
        Если пользователь был указан в списке участников игры, то он выдает пользователю jwt токен, в котором указан id игры.
    3. Пользователь при отправке сообщений в Игровой сервер прикрепляет к сообщениям выданный jwt токен,
        чтобы сервер при получении сообщения удостоверяется, что токен был выдан сервером авторизации (проверят хэш jwt токена)
        и проверяет, что пользователь запросил выполнение операции в игре, в которой он эту операцию может выполнять.

    Критерии оценки:
    1. Задача сдана на проверку - 1 балл.
    2. Код компилируется без ошибок, тесты выполняются успешно. - 1 балл
    3. Настроен CI, по которому можно определить успешность п. 2 - 2 балла
    4. Реализована аутентификация с помощью jwt (выдачу токенов выполняет сервис авторизации)- 2 балла
    5. Реализован запрос на сервис авторизации для создания нового космического боя - 2 балла
    6. Реализована проверка jwt во входящем сообщении на Игровом сервере - 2 балла

    Максимальная оценка за задание 10 баллов.
    Задание принимается, если было оценено не менее, чем в 7 баллов.

    Решение:
    1. AuthServer (выдаёт JWT) - отдельный микросервис (порт 8081)
✅   2. GameServer (валидирует JWT и выполняет команду) - отдельный микросервис (порт 8080)
✅   3. YAML парсится вручную (очень упрощённо)
✅   4. JWT реализован руками (HMAC-SHA256)

    Архитектура:
    Client (POST)
      ↓ (login + password hash)
    AuthServer
      ↓ (JWT)
    Client (POST)
      ↓ (JWT + command)
    GameServer
      ↓
    Validate JWT → Execute command

    JwtUtil:
    auth-service
    └── JwtUtil (generate)

    game-service
    └── JwtUtil (validate)
*/
public class GameServerMain {
  private static final Logger logger = LoggerFactory.getLogger(GameServerMain.class);

  public static void main(String[] args) throws Exception {
    logger.info(
        "Java version: {}, Java vendor: {}\nДомашнее задание#10: Создать микросервис Авторизация пользователя",
        System.getProperty("java.version"),
        System.getProperty("java.vendor"));
    GameServer gameServer = new GameServer(8080);
    gameServer.start();
    logger.debug("Server started on http://localhost:8080/users");
    gameServer.join();
  }
}
